"""
************************************************************************************************************
        集合:
            集合元素不能重复
                         1.add()            a = {1,2,3}
                                            a.add(4)
                                            print(a)                 打印:{1, 2, 3, 4}
                                            a.add("python")
                                            print(a)                打印:{1, 2, 3, 4,'python'}
print(a)                                    a.add((1,2,3))          打印:{1, 'python', 3, 2, 4, (1, 2, 3)}

                         2.update()         可以把集合合并




"""
"""
a = {1,2,3,4,"python"}
a.add((1,2,3))
print(a)


b ={"w","f","e"}
a.update(b)#a集合与b集合随机合并
print(a)
"""




"""
**************************************************************************************************************
            集合删除元素的方法
                   1.remove     删除集合中的元素如果有直接删除如果没有程序报错
                   2.pop        删除是随机删除集合中的元素如果集合没有元素程序报错
                   3.discard    删除如果元素存在直接删除如果元素不存在不做任何操作




"""
""""
***********************************************************************************
                集合的交集与并集
                        1.  交集使用 "&" 符号连接,得到相同的元素
                                            s1 = {1,2,3,4}
                                            s2 = {3,4,,5,6}
                                            print(s1&s2)        打印:{3, 4}
                        2.  并集使用 "|" 符号连接,得到集合中全部数据
                                             print(s1|s2)       打印:{1, 2, 3, 4, 5, 6}
                        
"""
